---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.HeatingCoilType
source: html/fa988b15-fa16-3048-4d29-9397963a8de6.htm
---
# Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.HeatingCoilType Property

The type of heating coil. Note this property change would reset the hot water loop.

## Syntax (C#)
```csharp
public AirHeatingCoilType HeatingCoilType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration